sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rcc_ex.c
        /* Require to disable power clock if necessary */
        if (pwrclkchanged == SET)
        {
            __HAL_RCC_PWR_CLK_DISABLE();
        }
    }




#if defined(RCC_CCIPR_USART2SEL)
    /*-------------------------- USART2 clock source configuration -------------------*/
    if (((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_USART2) == RCC_PERIPHCLK_USART2)
    {
        /* Check the parameters */
        assert_param(IS_RCC_USART2CLKSOURCE(PeriphClkInit->Usart2ClockSelection));

        /* Configure the USART2 clock source */
        __HAL_RCC_USART2_CONFIG(PeriphClkInit->Usart2ClockSelection);
    }
#endif /* RCC_CCIPR_USART2SEL */

//#if defined(RCC_CCIPR_LPUART1SEL)
//  /*-------------------------- LPUART1 clock source configuration ------------------*/
//  if (((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_LPUART1) == RCC_PERIPHCLK_LPUART1)
//  {
//    /* Check the parameters */
//    assert_param(IS_RCC_LPUART1CLKSOURCE(PeriphClkInit->Lpuart1ClockSelection));

//    /* Configure the LPUAR1 clock source */
//    __HAL_RCC_LPUART1_CONFIG(PeriphClkInit->Lpuart1ClockSelection);
//  }
//#endif /* RCC_CCIPR_LPUART1SEL */

#if defined(RCC_CCIPR_LPTIMSEL)
    /*-------------------------- LPTIM1 clock source configuration -------------------*/
    if (((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_LPTIM) == (RCC_PERIPHCLK_LPTIM))
    {
        assert_param(IS_RCC_LPTIM1CLKSOURCE(PeriphClkInit->LptimClockSelection));
        __HAL_RCC_LPTIM_CONFIG(PeriphClkInit->LptimClockSelection);
    }
#endif /* RCC_CCIPR_LPTIM1SEL */




//  /*-------------------------- ADC clock source configuration ----------------------*/
//  if (((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_ADC) == RCC_PERIPHCLK_ADC)
//  {
//    /* Check the parameters */
//    assert_param(IS_RCC_ADCCLKSOURCE(PeriphClkInit->AdcClockSelection));

//    /* Configure the ADC interface clock source */
//    __HAL_RCC_ADC_CONFIG(PeriphClkInit->AdcClockSelection);

//    if (PeriphClkInit->AdcClockSelection == RCC_ADCCLKSOURCE_PLLADC)
//    {
//      /* Enable PLLPCLK output */
//      __HAL_RCC_PLLCLKOUT_ENABLE(RCC_PLLPCLK);
//    }
//  }



#if defined(RCC_CCIPR_TIM1SEL)
    /*-------------------------- TIM1 clock source configuration ---------------------*/
    if (((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_TIM1) == RCC_PERIPHCLK_TIM1)
    {
        /* Check the parameters */
        assert_param(IS_RCC_TIM1CLKSOURCE(PeriphClkInit->Tim1ClockSelection));

        /* Configure the TIM1 clock source */
        __HAL_RCC_TIM1_CONFIG(PeriphClkInit->Tim1ClockSelection);

        if (PeriphClkInit->Tim1ClockSelection == RCC_TIM1CLKSOURCE_PLL)
        {
            /* Enable PLLQCLK output */
            __HAL_RCC_PLLCLKOUT_ENABLE(RCC_PLLQCLK);
        }
    }
#endif /* RCC_CCIPR_TIM1SEL */





    return HAL_OK;
}

/**
  * @brief  Get the RCC_ClkInitStruct according to the internal RCC configuration registers.
  * @param  PeriphClkInit pointer to an RCC_PeriphCLKInitTypeDef structure that
  *         returns the configuration information for the Extended Peripherals
  *         clocks: I2C1, I2S1, USART1, RTC, ADC,
  *         LPTIM1 (1), LPTIM2 (1), TIM1 (2), TIM15 (1)(2), USART2 (2), LPUART1 (1), CEC (1) and RNG (1)
  * @note (1) Peripheral is not available on all devices
  * @note (2) Peripheral clock selection is not available on all devices
  * @retval None
  */
void HAL_RCCEx_GetPeriphCLKConfig(RCC_PeriphCLKInitTypeDef  *PeriphClkInit)
{
    /* Set all possible values for the extended clock type parameter------------*/
    PeriphClkInit->PeriphClockSelection = RCC_PERIPHCLK_USART1 | RCC_PERIPHCLK_I2C1 | RCC_PERIPHCLK_I2S1 | \
                                          RCC_PERIPHCLK_ADC     | RCC_PERIPHCLK_RTC ;

#if defined(RCC_CCIPR_LPTIM1SEL) && defined(RCC_CCIPR_LPTIM2SEL)
    PeriphClkInit->PeriphClockSelection |=  RCC_PERIPHCLK_LPTIM2  | RCC_PERIPHCLK_LPTIM1;
#endif /* RCC_CCIPR_LPTIM1SEL && RCC_CCIPR_LPTIM2SEL */

#if defined(RCC_CCIPR_LPUART1SEL)
    PeriphClkInit->PeriphClockSelection |=  RCC_PERIPHCLK_LPUART1;
#endif /* RCC_CCIPR_LPUART1SEL */

#if defined(RCC_CCIPR_TIM1SEL)
    PeriphClkInit->PeriphClockSelection |=  RCC_PERIPHCLK_TIM1;
#endif /* RCC_CCIPR_TIM1SEL */

#if defined(RCC_CCIPR_USART2SEL)
    PeriphClkInit->PeriphClockSelection |=  RCC_PERIPHCLK_USART2;
#endif /* RCC_CCIPR_USART2SEL */


#if defined(RCC_CCIPR_USART2SEL)
    /* Get the USART2 clock source ---------------------------------------------*/
    PeriphClkInit->Usart2ClockSelection  = __HAL_RCC_GET_USART2_SOURCE();
#endif /* RCC_CCIPR_USART2SEL */
#if defined(RCC_CCIPR_LPUART1SEL)
    /* Get the LPUART1 clock source --------------------------------------------*/
    PeriphClkInit->Lpuart1ClockSelection = __HAL_RCC_GET_LPUART1_SOURCE();
#endif /* RCC_CCIPR_LPUART1SEL */
    /* Get the I2C1 clock source -----------------------------------------------*/
//  PeriphClkInit->I2c1ClockSelection    = __HAL_RCC_GET_I2C1_SOURCE();
#if defined(RCC_CCIPR_LPTIM1SEL)
    /* Get the LPTIM1 clock source ---------------------------------------------*/
    PeriphClkInit->Lptim1ClockSelection  = __HAL_RCC_GET_LPTIM1_SOURCE();
#endif /* RCC_CCIPR_LPTIM1SEL */
#if defined(RCC_CCIPR_LPTIM2SEL)
    /* Get the LPTIM2 clock source ---------------------------------------------*/
    PeriphClkInit->Lptim2ClockSelection  = __HAL_RCC_GET_LPTIM2_SOURCE();
#endif /* RCC_CCIPR_LPTIM2SEL */
#if defined(RCC_CCIPR_TIM1SEL)
    /* Get the TIM1 clock source ---------------------------------------------*/
    PeriphClkInit->Tim1ClockSelection  = __HAL_RCC_GET_TIM1_SOURCE();
#endif /* RCC_CCIPR_TIM1SEL */

    /* Get the RTC clock source ------------------------------------------------*/
    PeriphClkInit->RTCClockSelection     = __HAL_RCC_GET_RTC_SOURCE();
#if defined(RCC_CCIPR_RNGSEL)
    /* Get the RNG clock source ------------------------------------------------*/
    PeriphClkInit->RngClockSelection     = __HAL_RCC_GET_RNG_SOURCE();
#endif  /* RCC_CCIPR_RNGSEL */
    /* Get the ADC clock source -----------------------------------------------*/
//  PeriphClkInit->AdcClockSelection     = __HAL_RCC_GET_ADC_SOURCE();


