sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rcc_ex.c
}

/**
  * @brief  Return the peripheral clock frequency for peripherals with clock source from PLL
  * @note   Return 0 if peripheral clock identifier not managed by this API
  * @param  PeriphClk  Peripheral clock identifier
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_PERIPHCLK_RTC     RTC peripheral clock
  *            @arg @ref RCC_PERIPHCLK_ADC     ADC peripheral clock
  *            @arg @ref RCC_PERIPHCLK_I2C1    I2C1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_I2S1    I2S1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_USART1  USART1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_RNG     RNG peripheral clock    (1)
  *            @arg @ref RCC_PERIPHCLK_TIM15   TIM15 peripheral clock  (1)(2)
  *            @arg @ref RCC_PERIPHCLK_TIM1    TIM1 peripheral clock   (1)(2)
  *            @arg @ref RCC_PERIPHCLK_LPTIM1  LPTIM1 peripheral clock (1)
  *            @arg @ref RCC_PERIPHCLK_LPTIM2  LPTIM2 peripheral clock (1)
  *            @arg @ref RCC_PERIPHCLK_LPUART1 LPUART1 peripheral clock(1)
  *            @arg @ref RCC_PERIPHCLK_CEC     CEC peripheral clock    (1)
  *            @arg @ref RCC_PERIPHCLK_USART2  USART2 peripheral clock (1)(2)
  * @note   (1) Peripheral not available on all devices
  * @note   (2) Peripheral Clock configuration not available on all devices
  * @retval Frequency in Hz
  */
uint32_t HAL_RCCEx_GetPeriphCLKFreq(uint32_t PeriphClk)
{
    uint32_t frequency = 0U;
    uint32_t srcclk;
//  uint32_t pllvco;
//  uint32_t plln;
#if defined(RCC_CCIPR_RNGSEL)
    uint32_t rngclk;
    uint32_t rngdiv;
#endif
    /* Check the parameters */
    assert_param(IS_RCC_PERIPHCLOCK(PeriphClk));

    if (PeriphClk == RCC_PERIPHCLK_RTC)
    {
        /* Get the current RTC source */
        srcclk = __HAL_RCC_GET_RTC_SOURCE();

        /* Check if LSE is ready and if RTC clock selection is LSE */
//        if ((HAL_IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY)) && (srcclk == RCC_RTCCLKSOURCE_LSE))
//        {
//            frequency = LSE_VALUE;
//        }
        /* Check if LSI is ready and if RTC clock selection is LSI */
        if ((HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIRDY)) && (srcclk == RCC_RTCCLKSOURCE_LSI))
        {
            frequency = LSI_VALUE;
        }
        /* Check if HSE is ready  and if RTC clock selection is HSI_DIV32*/
        else if ((HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSERDY)) &&(srcclk == RCC_RTCCLKSOURCE_HSE_DIV32))
        {
            frequency = HSE_VALUE / 32U;
        }
        /* Clock not enabled for RTC*/
        else
        {
            /* Nothing to do as frequency already initialized to 0U */
        }
    }
    else
    {
        /* Other external peripheral clock source than RTC */

        /* Compute PLL clock input */
//    if (__HAL_RCC_GET_PLL_OSCSOURCE() == RCC_PLLSOURCE_HSI)  /* HSI ? */
//    {
//      pllvco = HSI_VALUE;
//    }
//    else if (__HAL_RCC_GET_PLL_OSCSOURCE() == RCC_PLLSOURCE_HSE)  /* HSE ? */
//    {
//      pllvco = HSE_VALUE;
//    }
//    else /* No source */
//    {
//      pllvco = 0U;
//    }

        /* f(PLL Source) / PLLM */
//    pllvco = (pllvco / ((READ_BIT(RCC->PLLCFGR, RCC_PLLCFGR_PLLM) >> RCC_PLLCFGR_PLLM_Pos) + 1U));

        switch (PeriphClk)
        {
#if defined(RCC_CCIPR_USART1)
        case RCC_PERIPHCLK_USART1:
            /* Get the current USART1 source */
            srcclk = __HAL_RCC_GET_USART1_SOURCE();

            if (srcclk == RCC_USART1CLKSOURCE_PCLK1)            /* PCLK1 ? */
            {
                frequency = HAL_RCC_GetPCLK1Freq();
            }
//        else if (srcclk == RCC_USART1CLKSOURCE_SYSCLK)     /* SYSCLK ? */
//        {
//          frequency = HAL_RCC_GetSysClockFreq();
//        }
//        else if ((HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY)) && (srcclk == RCC_USART1CLKSOURCE_HSI))
//        {
//          frequency = HSI_VALUE;
//        }
//        else if ((HAL_IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY)) && (srcclk == RCC_USART1CLKSOURCE_LSE))
//        {
//          frequency = LSE_VALUE;
//        }
            /* Clock not enabled for USART1 */
            else
            {
                /* Nothing to do as frequency already initialized to 0U */
            }
            break;
#endif


#if defined(RCC_CCIPR_LPUART1SEL)
        case RCC_PERIPHCLK_LPUART1:
            /* Get the current LPUART1 source */
            srcclk = __HAL_RCC_GET_LPUART1_SOURCE();

            if (srcclk == RCC_LPUART1CLKSOURCE_PCLK1)
            {
                frequency = HAL_RCC_GetPCLK1Freq();
            }
            else if (srcclk == RCC_LPUART1CLKSOURCE_SYSCLK)
            {
                frequency = HAL_RCC_GetSysClockFreq();
            }
            else if ((HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY)) && (srcclk == RCC_LPUART1CLKSOURCE_HSI))
            {
                frequency = HSI_VALUE;
            }
            else if ((HAL_IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY)) && (srcclk == RCC_LPUART1CLKSOURCE_LSE))
            {
                frequency = LSE_VALUE;
            }
            /* Clock not enabled for LPUART1 */
            else
            {
                /* Nothing to do as frequency already initialized to 0U */
            }
            break;
#endif /* RCC_CCIPR_LPUART1SEL */

#if defined(RCC_CCIPR_ADC)
        case RCC_PERIPHCLK_ADC:

            srcclk = __HAL_RCC_GET_ADC_SOURCE();

            if (srcclk == RCC_ADCCLKSOURCE_SYSCLK)
            {
                frequency = HAL_RCC_GetSysClockFreq();
            }
            else if (srcclk == RCC_ADCCLKSOURCE_HSI)
            {
                frequency = HSI_VALUE;
            }
            else if (srcclk == RCC_ADCCLKSOURCE_PLLADC)
            {
                if (__HAL_RCC_GET_PLLCLKOUT_CONFIG(RCC_PLLPCLK) != 0U)
                {
                    /* f(PLLP) = f(VCO input) * PLLN / PLLP */
                    plln = READ_BIT(RCC->PLLCFGR, RCC_PLLCFGR_PLLN) >> RCC_PLLCFGR_PLLN_Pos;
                    frequency = (pllvco * plln) / ((READ_BIT(RCC->PLLCFGR, RCC_PLLCFGR_PLLP) >> RCC_PLLCFGR_PLLP_Pos) + 1U);
                }
            }
            /* Clock not enabled for ADC */
            else
            {
                /* Nothing to do as frequency already initialized to 0U */
            }
            break;
#endif

#if defined(RCC_CCIPR_I2C1)
        case RCC_PERIPHCLK_I2C1:
            /* Get the current I2C1 source */
            srcclk = __HAL_RCC_GET_I2C1_SOURCE();

