sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rcc_ex.c
            if (srcclk == RCC_I2C1CLKSOURCE_PCLK1)
            {
                frequency = HAL_RCC_GetPCLK1Freq();
            }
//        else if (srcclk == RCC_I2C1CLKSOURCE_SYSCLK)
//        {
//          frequency = HAL_RCC_GetSysClockFreq();
//        }
//        else if ((HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY)) && (srcclk == RCC_I2C1CLKSOURCE_HSI))
//        {
//          frequency = HSI_VALUE;
//        }
            /* Clock not enabled for I2C1 */
            else
            {
                /* Nothing to do as frequency already initialized to 0U */
            }
            break;
#endif


#if defined(RCC_CCIPR_LPTIM1SEL)
        case RCC_PERIPHCLK_LPTIM1:
            /* Get the current LPTIM1 source */
            srcclk = __HAL_RCC_GET_LPTIM1_SOURCE();

            if (srcclk == RCC_LPTIM1CLKSOURCE_PCLK1)
            {
                frequency = HAL_RCC_GetPCLK1Freq();
            }
            else if ((HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIRDY)) && (srcclk == RCC_LPTIM1CLKSOURCE_LSI))
            {
                frequency = LSI_VALUE;
            }
            else if ((HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY)) && (srcclk == RCC_LPTIM1CLKSOURCE_HSI))
            {
                frequency = HSI_VALUE;
            }
            else if ((HAL_IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY)) && (srcclk == RCC_LPTIM1CLKSOURCE_LSE))
            {
                frequency = LSE_VALUE;
            }
            /* Clock not enabled for LPTIM1 */
            else
            {
                /* Nothing to do as frequency already initialized to 0U */
            }
            break;
#endif /* RCC_CCIPR_LPTIM1SEL */


#if defined(RCC_CCIPR_TIM1SEL)
        case RCC_PERIPHCLK_TIM1:

            srcclk = READ_BIT(RCC->CCIPR, RCC_CCIPR_TIM1SEL);

            if (srcclk == RCC_TIM1CLKSOURCE_PLL) /* PLL ? */
            {
                if (__HAL_RCC_GET_PLLCLKOUT_CONFIG(RCC_PLLQCLK) != 0U)
                {
                    /* f(PLLQ) = f(VCO input) * PLLN / PLLQ */
                    plln = READ_BIT(RCC->PLLCFGR, RCC_PLLCFGR_PLLN) >> RCC_PLLCFGR_PLLN_Pos;
                    frequency = (pllvco * plln) / ((READ_BIT(RCC->PLLCFGR, RCC_PLLCFGR_PLLQ) >> RCC_PLLCFGR_PLLQ_Pos) + 1U);
                }
            }
            else if (srcclk == RCC_TIM1CLKSOURCE_PCLK1) /* PCLK1 ? */
            {
                frequency = HAL_RCC_GetPCLK1Freq();
            }
            else /* No clock source */
            {
                /* Nothing to do as frequency already initialized to 0U */
            }
            break;
#endif /* RCC_CCIPR_TIM1SEL */



        default:
            break;
        }
    }

    return (frequency);
}

/**
  * @}
  */

/** @defgroup RCCEx_Exported_Functions_Group2 Extended Clock management functions
 *  @brief  Extended Clock management functions
 *
@verbatim
 ===============================================================================
                ##### Extended clock management functions  #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the
    activation or deactivation of LSE CSS, Low speed clock output and
    clock after wake-up from STOP mode.
@endverbatim
  * @{
  */

///**
//  * @brief  Select the Low Speed clock source to output on LSCO pin (PA2).
//  * @param  LSCOSource  specifies the Low Speed clock source to output.
//  *          This parameter can be one of the following values:
//  *            @arg @ref RCC_LSCOSOURCE_LSI  LSI clock selected as LSCO source
//  *            @arg @ref RCC_LSCOSOURCE_LSE  LSE clock selected as LSCO source
//  * @retval None
//  */
//void HAL_RCCEx_EnableLSCO(uint32_t LSCOSource)
//{
//  GPIO_InitTypeDef GPIO_InitStruct;
//  FlagStatus       pwrclkchanged = RESET;
//  FlagStatus       backupchanged = RESET;

//  /* Check the parameters */
//  assert_param(IS_RCC_LSCOSOURCE(LSCOSource));

//  /* LSCO Pin Clock Enable */
//  LSCO_CLK_ENABLE();

//  /* Configue the LSCO pin in analog mode */
//  GPIO_InitStruct.Pin = LSCO_PIN;
//  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
//  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
//  GPIO_InitStruct.Pull = GPIO_NOPULL;
//  HAL_GPIO_Init(LSCO_GPIO_PORT, &GPIO_InitStruct);

//  /* Update LSCOSEL clock source in Backup Domain control register */
//  if (__HAL_RCC_PWR_IS_CLK_DISABLED())
//  {
//    __HAL_RCC_PWR_CLK_ENABLE();
//    pwrclkchanged = SET;
//  }
//  if (HAL_IS_BIT_CLR(PWR->CR1, PWR_CR1_DBP))
//  {
//    HAL_PWR_EnableBkUpAccess();
//    backupchanged = SET;
//  }

//  MODIFY_REG(RCC->BDCR, RCC_BDCR_LSCOSEL | RCC_BDCR_LSCOEN, LSCOSource | RCC_BDCR_LSCOEN);

//  if (backupchanged == SET)
//  {
//    HAL_PWR_DisableBkUpAccess();
//  }
//  if (pwrclkchanged == SET)
//  {
//    __HAL_RCC_PWR_CLK_DISABLE();
//  }
//}

///**
//  * @brief  Disable the Low Speed clock output.
//  * @retval None
//  */
//void HAL_RCCEx_DisableLSCO(void)
//{
//  FlagStatus       pwrclkchanged = RESET;
//  FlagStatus       backupchanged = RESET;

//  /* Update LSCOEN bit in Backup Domain control register */
//  if (__HAL_RCC_PWR_IS_CLK_DISABLED())
//  {
//    __HAL_RCC_PWR_CLK_ENABLE();
//    pwrclkchanged = SET;
//  }
//  if (HAL_IS_BIT_CLR(PWR->CR1, PWR_CR1_DBP))
//  {
//    /* Enable access to the backup domain */
//    HAL_PWR_EnableBkUpAccess();
//    backupchanged = SET;
//  }

//  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSCOEN);

//  /* Restore previous configuration */
//  if (backupchanged == SET)
//  {
//    /* Disable access to the backup domain */
//    HAL_PWR_DisableBkUpAccess();
//  }
//  if (pwrclkchanged == SET)
//  {
//    __HAL_RCC_PWR_CLK_DISABLE();
//  }
//}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_RCC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
